<template>
  <div class="mainDiv">
    <div class="headerDiv">
      <p class="pBig">Вопросы и ответы</p>
      <p class="pSmall">Вопросы и ответы</p>
      <button :class="{visibleBlock: !this.show}" v-on:click="choosedAndCheckWidth()" class="btn-back">Назад</button>
    </div>
    <div class="askAnswersDiv">
      <div class="asksDiv" :class="{invisibleBlock: !showask}">
        <div
          :class="{ active: choosed === ask.id }"
          v-on:click="choosedAndCheckWidth(ask.id)"
          class="askDiv"
          v-for="ask in listAskAnswers"
          :key="ask.id"
        >
          <div>
            <img
              class="lapaClass"
              v-if="choosed != ask.id"
              src="/images/icons/dogGreen.svg"
              alt="Иконка зеленой лапы"
            />
            <img
              class="lapaClass"
              v-else
              src="/images/icons/dogRotate.svg"
              alt="Иконка Крученой лапы"
            />
          </div>
          <div class="divAsk">
            <p class="pAsk">{{ ask.ask }}</p>
          </div>
        </div>
      </div>
      <div class="rightDiv" :class="{visibleBlock: !showansw}">
        <div class="divWithAsk">
          <p class="pWithAsk">{{ listAskAnswers[choosed].ask }}</p>
        </div>
        <div class="divWithAnswer"></div>
        <p class="pWithAnswer">
          {{ choosed }}{{ listAskAnswers[choosed].answer }}
        </p>
      </div>
    </div>
    <div style="height: 150px"></div>
  </div>
</template>

<script>
export default {
  name: "AsksAnswers",
  data() {
    return {
      show: false,
      choosed: 1,
      clicked: 0,
      showask: true,
      showansw: true,
      listAskAnswers: [
        {
          id: 1,
          ask: "Зачем мне это надо?",
          answer:
            "Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы."
        },
        {
          id: 2,
          ask: "Как попасть в поход?",
          answer:
            "Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы."
        },
        {
          id: 3,
          ask: "Что нужно взять в поход?",
          answer:
            "Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы."
        },
        {
          id: 4,
          ask: "Что лучше для пешего похода- ботинки или кроссовки?",
          answer:
            "Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы."
        },
        {
          id: 5,
          ask: "Работают ли мобильные телефоны в горах?",
          answer:
            "Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы."
        },
        {
          id: 6,
          ask: "Есть ли возможность где- то подзарядить технику?",
          answer:
            "Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы."
        },
        {
          id: 7,
          ask: "Часто ли бывают привалы?",
          answer:
            "Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы."
        },
        {
          id: 8,
          ask: "А если я заболею и не смогу дальше идти?",
          answer:
            "Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы."
        },
        {
          id: 9,
          ask: "Как мыться и соблюдать гигиену в походах?",
          answer:
            "Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы."
        },
        {
          id: 10,
          ask: "Возможна ли в походе рыбалка?",
          answer:
            "Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы."
        },
        {
          id: 11,
          ask: "Можно ли взять с собой собаку?",
          answer:
            "Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы."
        },
        {
          id: 12,
          ask:
            "Если я вегетарианец (-ка) или просто не ем тушёнку, сгущёнку, что-то ещё?",
          answer:
            "Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы."
        }
      ]
    };
  },
  methods: {
    choosedAndCheckWidth(id) {
      if (id) {
        this.choosed = id;
      }
      if (window.innerWidth < 800){
          this.clicked = 1
          this.show = !this.show;
          this.showask = this.showansw;
          this.showansw = !this.showask;
      }
    },
    handleResize() {
      if (window.innerWidth < 800 && this.showask !== false){
        this.showansw = false;
      }
      else if(window.innerWidth > 800){
        this.showansw = true;
        this.showask = true;
        this.show = false;
      }
    }
  },
  created() {
    window.addEventListener("resize", this.handleResize);
    this.handleResize();
  },
  destroyed() {
    window.removeEventListener("resize", this.handleResize);
  }
};
</script>

<style scoped>
.mainDiv {
  display: flex;
  flex-direction: column;
  justify-content: space-around;
  align-items: center;
  margin-top: 40px;
  background-image: url("/forest-river.jpg");
}

.headerDiv {
  display: flex;
  justify-content: center;
  flex-direction: column;
  align-items: center;
}

.askAnswersDiv {
  display: flex;
  justify-content: space-around;
}

.asksDiv {
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
}

.askDiv {
  display: flex;
  align-items: center;
  justify-content: flex-start;
  width: 85%;
  padding-left: 6px;
  height: 50px;
}

.askDiv:hover {
  background-color: #7aa5aa;
  color: #ffffff;
  box-shadow: 2px 2px 2px 1px rgba(0, 0, 0, 0.25);
  cursor: pointer;
}

.askDiv.active {
  background-color: #7aa5aa;
  color: #ffffff;
  box-shadow: 2px 2px 2px 1px rgba(0, 0, 0, 0.25);
}

.rightDiv {
  display: flex;
  flex-direction: column;
  max-width: 30%;
  border: 1px solid deepskyblue;
  /*border-image-source: linear-gradient(180deg, #7CA5CA 0%, rgba(124, 165, 202, 0) 100%);*/
}

.pBig {
  color: rgba(46, 89, 94, 0.15);
  font-family: archivo, sans-serif;
  font-size: 64px;
  margin: 0;
}

.pSmall {
  margin: 0;
  color: #2e595e;
  font-family: archivo, sans-serif;
  font-size: 48px;
  margin-top: -45px;
  margin-bottom: 30px;
}

.pAsk {
  font-size: 18px;
  font-family: archivo, sans-serif;
}

.divAsk {
  width: 90%;
  margin-left: 2%;
}

.divWithAsk {
  background: linear-gradient(180deg, #7aa5aa 0%, rgba(122, 165, 170, 0) 100%);
  height: 70px;
  display: flex;
  align-items: center;
}

.pWithAsk {
  font-size: 22px;
  font-family: archivo, sans-serif;
  margin: 0 12px;
}

.divWithAnswer {
  height: 1px;
  border-top: 1px solid #7ca5ca;
  width: 70%;
}

.pWithAnswer {
  width: 85%;
  font-size: 18px;
  font-family: archivo, sans-serif;
  margin-left: 4%;
  margin-top: 20px;
}
.visibleBlock{
  display: none;
}
.invisibleBlock{
  display: none;
}
.btn-back{
  background: transparent;
  transition: 0.5s;
  width: 120px;
  height: 30px;
  border: 1px solid #7ca5ca;
  filter: drop-shadow(0px 0px 3px #1a456c);
  margin-bottom: 10px;
}
.btn-back:hover {
  background-color: cadetblue;
}

.btn-back:focus {
  outline: none;
}
@media screen and (max-width: 800px) {
  .pBig{
    display: none;
  }
  .pSmall{
    margin: 10px 0;
  }
  .rightDiv{
    max-width: 70%;
  }
}
</style>
