<template>
  <div style="height: 100vh; width: 100%">
    <div class="topDiv">
      <p style="color: rgba(255, 255, 255, 0.25); font-family: archivo; font-weight: bold; font-size: 64px; margin: 0">Программа тура</p>
      <p style="color: white; font-family: archivo; font-weight: bold; font-size: 30px; margin-top: -30px">Программа тура</p>
    </div>
    <div class="botDiv">
      <div class="mainDiv">
        <div></div>
        <div class="leftDiv">
          <div class="titleDiv" style="justify-content: flex-start"><p style="font-size: 32px; font-family: streamster; margin: 0">День {{currentDay}}</p></div>
          <div><p style="font-family: archivo">{{otherContent[id].days[currentDay][0]}}</p></div>
          <div class="buttonDiv">
            <button class="buttonStyle" v-on:click="currentDay -= 1" v-if="currentDay > 1"><p style="font-size: 18px; font-family: streamster; margin: 0">&#8592; День {{currentDay - 1}}</p></button>
            <button class="buttonStyle" v-on:click="currentDay += 1" v-if="currentDay < Object.keys(otherContent[id].days).length"><p style="font-size: 18px; font-family: streamster; margin: 0">День {{currentDay + 1}} &#8594;</p></button>
          </div>
        </div>
        <div class="rightDiv">
          <img style="align-self: center; max-height: 220px" width="100%" :src="otherContent[id].pictures[currentDay - 1]" alt="Дикпик">
          <div class="titleDiv"><p style="font-family: archivo; font-size: 24px; margin: 0">{{tour}}</p></div>
          <div><p style="font-family: archivo">{{otherContent[id].underPicContent[currentDay - 1]}}</p></div>
        </div>
        <div></div>
      </div>
      <div style="display: flex; justify-content: center; align-items: center">
        <button class="buttonStyle" style="width: 250px; height: 43px; border: 1px solid #7CA5CA; filter: drop-shadow(0px 0px 3px #1A456C);">Подробнее</button>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      id: this.$route.params['id'],
      tour: this.$route.params['tour'],
      currentDay: 1,
      otherContent: {
        1 : {
          days: {
            1: ['Оба дня пройдут по легендарной тропе первооткрывателя Тунгусского метеорита Л. А. Кулика. Тропа полностью сохранилась до наших дней. Эта часть маршрута сложная, тропа не облагорожена, пролегает через буреломы и болота. Но тем она и интересна, поскольку сохранила свою аутентичность. Ночуем в палатках. За 2 дня нам предстоит пройти в общей сложности около 38 км К вечеру третьего дня мы окажемся на границе с Тунгусским заповедником.'],
            2: ['Не следует, однако, забывать о том, что начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации дальнейших направлений развития проекта. Разнообразный и богатый опыт постоянное информационно-техническое обеспечение нашей деятельности требует от нас системного анализа ключевых компонентов планируемого обновления!'],
            3: ['Повседневная практика показывает, что рамки и место обучения кадров позволяет выполнить важнейшие задания по разработке позиций, занимаемых участниками в отношении поставленных задач.\n' + 'С другой стороны рамки и место обучения кадров обеспечивает актуальность всесторонне сбалансированных нововведений.'],

          },
          pictures: ['/day1picforest.jpg', '/day1picforest.jpg', '/day1picforest.jpg',],
          underPicContent: [
            '1 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
            '2 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
            '3 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
          ],
        },
        2 : {
          days: {
            1: ['Оба дня пройдут по легендарной тропе первооткрывателя Тунгусского метеорита Л. А. Кулика. Тропа полностью сохранилась до наших дней. Эта часть маршрута сложная, тропа не облагорожена, пролегает через буреломы и болота. Но тем она и интересна, поскольку сохранила свою аутентичность. Ночуем в палатках. За 2 дня нам предстоит пройти в общей сложности около 38 км К вечеру третьего дня мы окажемся на границе с Тунгусским заповедником.'],
            2: ['Не следует, однако, забывать о том, что начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации дальнейших направлений развития проекта. Разнообразный и богатый опыт постоянное информационно-техническое обеспечение нашей деятельности требует от нас системного анализа ключевых компонентов планируемого обновления!'],
            3: ['Повседневная практика показывает, что рамки и место обучения кадров позволяет выполнить важнейшие задания по разработке позиций, занимаемых участниками в отношении поставленных задач.\n' + 'С другой стороны рамки и место обучения кадров обеспечивает актуальность всесторонне сбалансированных нововведений.'],

          },
          pictures: ['/day1picforest.jpg', '/day1picforest.jpg', '/day1picforest.jpg',],
          underPicContent: [
            '1 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
            '2 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
            '3 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
          ],
        },
        3 : {
          days: {
            1: ['Оба дня пройдут по легендарной тропе первооткрывателя Тунгусского метеорита Л. А. Кулика. Тропа полностью сохранилась до наших дней. Эта часть маршрута сложная, тропа не облагорожена, пролегает через буреломы и болота. Но тем она и интересна, поскольку сохранила свою аутентичность. Ночуем в палатках. За 2 дня нам предстоит пройти в общей сложности около 38 км К вечеру третьего дня мы окажемся на границе с Тунгусским заповедником.'],
            2: ['Не следует, однако, забывать о том, что начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации дальнейших направлений развития проекта. Разнообразный и богатый опыт постоянное информационно-техническое обеспечение нашей деятельности требует от нас системного анализа ключевых компонентов планируемого обновления!'],
            3: ['Повседневная практика показывает, что рамки и место обучения кадров позволяет выполнить важнейшие задания по разработке позиций, занимаемых участниками в отношении поставленных задач.\n' + 'С другой стороны рамки и место обучения кадров обеспечивает актуальность всесторонне сбалансированных нововведений.'],

          },
          pictures: ['/day1picforest.jpg', '/day1picforest.jpg', '/day1picforest.jpg',],
          underPicContent: [
            '1 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
            '2 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
            '3 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
          ],
        },
        4 : {
          days: {
            1: ['Оба дня пройдут по легендарной тропе первооткрывателя Тунгусского метеорита Л. А. Кулика. Тропа полностью сохранилась до наших дней. Эта часть маршрута сложная, тропа не облагорожена, пролегает через буреломы и болота. Но тем она и интересна, поскольку сохранила свою аутентичность. Ночуем в палатках. За 2 дня нам предстоит пройти в общей сложности около 38 км К вечеру третьего дня мы окажемся на границе с Тунгусским заповедником.'],
            2: ['Не следует, однако, забывать о том, что начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации дальнейших направлений развития проекта. Разнообразный и богатый опыт постоянное информационно-техническое обеспечение нашей деятельности требует от нас системного анализа ключевых компонентов планируемого обновления!'],
            3: ['Повседневная практика показывает, что рамки и место обучения кадров позволяет выполнить важнейшие задания по разработке позиций, занимаемых участниками в отношении поставленных задач.\n' + 'С другой стороны рамки и место обучения кадров обеспечивает актуальность всесторонне сбалансированных нововведений.'],

          },
          pictures: ['/day1picforest.jpg', '/day1picforest.jpg', '/day1picforest.jpg',],
          underPicContent: [
            '1 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
            '2 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
            '3 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
          ],
        },
        5 : {
          days: {
            1: ['Оба дня пройдут по легендарной тропе первооткрывателя Тунгусского метеорита Л. А. Кулика. Тропа полностью сохранилась до наших дней. Эта часть маршрута сложная, тропа не облагорожена, пролегает через буреломы и болота. Но тем она и интересна, поскольку сохранила свою аутентичность. Ночуем в палатках. За 2 дня нам предстоит пройти в общей сложности около 38 км К вечеру третьего дня мы окажемся на границе с Тунгусским заповедником.'],
            2: ['Не следует, однако, забывать о том, что начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации дальнейших направлений развития проекта. Разнообразный и богатый опыт постоянное информационно-техническое обеспечение нашей деятельности требует от нас системного анализа ключевых компонентов планируемого обновления!'],
            3: ['Повседневная практика показывает, что рамки и место обучения кадров позволяет выполнить важнейшие задания по разработке позиций, занимаемых участниками в отношении поставленных задач.\n' + 'С другой стороны рамки и место обучения кадров обеспечивает актуальность всесторонне сбалансированных нововведений.'],

          },
          pictures: ['/day1picforest.jpg', '/day1picforest.jpg', '/day1picforest.jpg',],
          underPicContent: [
            '1 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
            '2 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
            '3 Не следует, однако, забывать о том, что выбранный нами инновационный путь представляет собой интересный эксперимент проверки экономической целесообразности принимаемых решений. Разнообразный и богатый опыт повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании форм воздействия. Значимость...',
          ],
        },
      }
    }
  },
  name: "AboutTour",
}
</script>

<style scoped>
.topDiv{
  background-image: url('/darkForest.jpg');
  background-size: cover;
  background-position: center;
  height: 30%;
  display: flex;
  flex-direction: column;
  align-items: center;
  justify-content: flex-end;
}
.botDiv{
  background-image: url('/brightForest.jpg');
  background-size: cover;
  background-position: center;
  height: 70%;
}
.mainDiv{
  display: flex;
  justify-content: space-around;
  align-items: center;
  width: 100%;
  height: 85%;
}
.leftDiv{
  display: flex;
  padding: 20px;
  max-height: 70%;
  flex-direction: column;
  justify-content: space-around;
  align-items: flex-start;
  max-width: 30%;
  box-shadow: 3px 3px 3px 1px rgba(0, 0, 0, 0.25);
  border: 1px solid steelblue;
  /*border-image-source: linear-gradient(180deg, #7CA5CA 0%, rgba(124, 165, 202, 0) 100%);*/
}
.rightDiv{
  display: flex;
  max-height: 450px;
  padding: 1.4%;
  flex-direction: column;
  justify-content: space-around;
  align-items: flex-start;
  max-width: 45%;
  box-shadow: 3px 3px 3px 1px rgba(0, 0, 0, 0.25);
  border: 1px solid steelblue;
  /*border-image-source: linear-gradient(180deg, #7CA5CA 0%, rgba(124, 165, 202, 0) 100%);*/
}
.titleDiv{
  display: flex;
  justify-content: center;
  align-items: center;
  width: 100%;
}
.buttonDiv{
  display: flex;
  justify-content: space-around;
  width: 50%;
}
.buttonStyle{
  background: transparent;
  transition: 0.5s;
}
.buttonStyle:hover{
  background-color: cadetblue;
}
.buttonStyle:focus{
  outline: none;
}
</style>
