<template>
  <div class="mainDiv">
    <div class="headerDiv">
      <p style="color: rgba(46, 89, 94, 0.15); font-family: archivo; font-size: 64px; margin: 0">Вопросы и ответы</p>
      <p style="color: #2E595E; font-family: archivo; font-size: 48px; margin: 0; margin-top: -45px; margin-bottom: 30px">Вопросы и ответы</p>
    </div>
    <div class="askAnswersDiv">
      <div style="width: 15%"></div>
      <div class="asksDiv">
        <div :class="{active : chosed==ask.id}" v-on:click="chosed = ask.id" class="askDiv" v-for="ask in listAskAnswers" :key="ask.id">
          <div>
            <DogGreen class="lapaClass" v-if="chosed!=ask.id"></DogGreen>
            <DogRotate class="lapaClass" v-else></DogRotate>
          </div>
          <div style="width: 90%; margin-left: 2%">
            <p style="font-size: 18px; font-family: archivo;">{{ask.ask}}</p>
          </div>
        </div>
      </div>
      <div class="rightDiv">
        <div style="background: linear-gradient(180deg, #7AA5AA 0%, rgba(122, 165, 170, 0) 100%); height: 60px; display: flex; align-items: center">
          <p style="font-size: 22px; font-family: archivo; margin-left: 4%">{{listAskAnswers[chosed].ask}}</p>
        </div>
        <div style="height: 1px; border-top: 1px solid #7CA5CA; width: 70%"></div>
        <p style="width: 85%; font-size: 18px; font-family: archivo; margin-left: 4%">{{chosed}}{{listAskAnswers[chosed].answer}}</p>
      </div>
      <div style="width: 10%"></div>
    </div>
    <div style="height: 100px"></div>
  </div>
</template>

<script>
import DogRotate from './svgComponents/DogRotate'
import DogGreen from './svgComponents/DogGreen'

export default {
name: "AsksAnswers",
  data(){
  return{
    chosed: 1,
    listAskAnswers: [
      {
        id: 1,
        ask: 'Зачем мне это надо?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 2,
        ask: 'Как попасть в поход?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 3,
        ask: 'Что нужно взять в поход?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 4,
        ask: 'Что лучше для пешего похода- ботинки или кроссовки?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 5,
        ask: 'Работают ли мобильные телефоны в горах?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 6,
        ask: 'Есть ли возможность где- то подзарядить технику?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 7,
        ask: 'Часто ли бывают привалы?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 8,
        ask: 'А если я заболею и не смогу дальше идти?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 9,
        ask: 'Как мыться и соблюдать гигиену в походах?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 10,
        ask: 'Возможна ли в походе рыбалка?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 11,
        ask: 'Можно ли взять с собой собаку?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 12,
        ask: 'Если я вегетарианец (-ка) или просто не ем тушёнку, сгущёнку, что-то ещё?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },

    ],
  }
  },
  components:{
    DogGreen,
    DogRotate,

  }
}
</script>

<style scoped>
.mainDiv{
  display: flex;
  flex-direction: column;
  justify-content: space-around;
  align-items: center;
  margin-top: 40px;
  background-image: url("/forest-river.jpg");
}
.headerDiv{
  display: flex;
  justify-content: center;
  flex-direction: column;
  align-items: center;
}
.askAnswersDiv{
  display: flex;
  justify-content: space-around;
}
.asksDiv{
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: flex-start;
}
.askDiv{
  display: flex;
  align-items: center;
  justify-content: flex-start;
  width: 85%;
  padding-left: 6px;
  height: 50px;
}
.askDiv:hover{
  background-color: #7AA5AA;
  color: #FFFFFF;
  box-shadow: 2px 2px 2px 1px rgba(0, 0, 0, 0.25);
}
.askDiv.active{
  background-color: #7AA5AA;
  color: #FFFFFF;
  box-shadow: 2px 2px 2px 1px rgba(0, 0, 0, 0.25);
}
.rightDiv{
  display: flex;
  flex-direction: column;
  width: 40%;
  border: 1px solid;
  border-image-source: linear-gradient(180deg, #7CA5CA 0%, rgba(124, 165, 202, 0) 100%);
}
.lapaClass{
}
</style>
