<template>
  <div class="mainDiv">
    <div class="headerDiv">
      <p style="color: rgba(46, 89, 94, 0.15); font-family: archivo; font-size: 64px; margin: 0">Вопросы и ответы</p>
      <p style="color: #2E595E; font-family: archivo; font-size: 48px; margin: 0; margin-top: -40px">Вопросы и ответы</p>
    </div>
    <div class="askAnswersDiv">
      <div class="asksDiv">
        <div v-for="ask in listAskAnswers" :key="ask.id">
          <p class="askP" :class="{active : chosed==ask.id}" v-on:click="chosed = ask.id">{{ask.ask}}</p>
        </div>
      </div>
      <div>
        <p>{{chosed}}{{listAskAnswers[chosed].answer}}</p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
name: "AsksAnswers",
  data(){
  return{
    chosed: 1,
    listAskAnswers: [
      {
        id: 1,
        ask: 'Зачем мне это надо?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 2,
        ask: 'Как попасть в поход?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 3,
        ask: 'Что нужно взять в поход?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 4,
        ask: 'Что лучше для пешего похода- ботинки или кроссовки?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 5,
        ask: 'Работают ли мобильные телефоны в горах?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 6,
        ask: 'Есть ли возможность где- то подзарядить технику?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 7,
        ask: 'Часто ли бывают привалы?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 8,
        ask: 'А если я заболею и не смогу дальше идти?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 9,
        ask: 'Как мыться и соблюдать гигиену в походах?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 10,
        ask: 'Возможна ли в походе рыбалка?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 11,
        ask: 'Можно ли взять с собой собаку?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },
      {
        id: 12,
        ask: 'Если я вегетарианец (-ка) или просто не ем тушёнку, сгущёнку, что-то ещё?',
        answer: 'Для начала вам необходимо определиться, куда пойти в поход и когда, в этом вам поможет поиск по походам. После того, как вы выбрали маршрут и сроки и путешествия, нужно заполнить заявку и получить по почте письмо с информацией. До похода вас будет вести опытный координатор, отвечать на все вопросы по почте и телефону, информировать о способах оплаты, списке необходимого снаряжения, билетах. А за неделю до похода на электронную почту вы получите Памятку с телефоном инструктора, информацией о времени и месте встречи группы, и список группы.',
      },

    ],
  }
  }
}
</script>

<style scoped>
.mainDiv{
  display: flex;
  flex-direction: column;
  justify-content: space-around;
  align-items: center;
  margin-top: 40px;
  background-image: url("/forest-river.jpg");
}
.headerDiv{
  display: flex;
  justify-content: center;
  flex-direction: column;
  align-items: center;
}
.askAnswersDiv{
  display: flex;
  justify-content: space-around;
}
.asksDiv{
  display: flex;
  flex-direction: column;
  justify-content: flex-start;
  align-items: flex-start;
}
.askP{

}
.askP:hover{
  background-color: #2E595E;
  color: #FFFFFF;
}
.askP.active{
  background-color: #2E595E;
  color: #FFFFFF;
}
</style>
